       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       AUTHOR. GROUP4.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMP-PAYROLL ASSIGN TO "EMP-PAY.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
     
       DATA DIVISION.
       FILE SECTION.
           FD EMP-PAYROLL
               DATA RECORD IS EMP-REC.
           01  EMP-REC PIC X(100).

       WORKING-STORAGE SECTION.
       01 HDR-1.
           02 FILLER PIC X(37) VALUE SPACES.
           02 FILLER PIC X(25) VALUE "ABCDEF TECHNOLOGY COMPANY".
       01 HDR-2.
           02 FILLER PIC X(42) VALUE SPACES.
           02 FILLER PIC X(16) VALUE "EMPLOYEE PAYROLL".

       01 COLUMN-TOP.
           02 FILLER PIC X(6)  VALUE SPACES.
           02 FILLER PIC X(13) VALUE "EMPLOYEE TYPE".
           02 FILLER PIC X(4)  VALUE SPACES.
           02 FILLER PIC X(6)  VALUE "NO. OF".
           02 FILLER PIC X(4)  VALUE SPACES.
           02 FILLER PIC X(9)  VALUE "BASIC PAY".
           02 FILLER PIC X(4)  VALUE SPACES.
           02 FILLER PIC X(9)  VALUE "ALLOWANCE".
           02 FILLER PIC X(4)  VALUE SPACES.
           02 FILLER PIC X(9)  VALUE "GROSS PAY".
           02 FILLER PIC X(4)  VALUE SPACES.
           02 FILLER PIC X(10) VALUE "DEDUCTIONS".
           02 FILLER PIC X(4)  VALUE SPACES.
           02 FILLER PIC X(7)  VALUE "NET PAY".
       01 COLUMN-BOTTOM.
           02 FILLER PIC X(21) VALUE SPACES.
           02 FILLER PIC X(9)  VALUE "EMPLOYEES".
           
       01 PAYROLL-DISPLAY.
           02 DISP-TYPE     PIC X(14)    OCCURS 4 TIMES.
           02 DISP-EMPNO    PIC ZZ9      OCCURS 4 TIMES.
           02 DISP-BASIC    PIC Z(6)9V99 OCCURS 4 TIMES.
           02 DISP-ALLOWC   PIC Z(6)9V99 OCCURS 4 TIMES.
           02 DISP-GROSS    PIC Z(6)9V99 OCCURS 4 TIMES.
           02 DISP-DEDUCT   PIC Z(6)9V99 OCCURS 4 TIMES.
           02 DISP-NET      PIC Z(6)9V99 OCCURS 4 TIMES.
       01 TOTAL-DISPLAY.
           02 FILLER        PIC X(5) VALUE "TOTAL".
           02 TLDISP-EMPNO  PIC ZZ9.
           02 TLDISP-BASIC  PIC Z(6)9.99.
           02 TLDISP-ALLOWC PIC Z(6)9.99.
           02 TLDISP-GROSS  PIC Z(6)9.99.
           02 TLDISP-DEDUCT PIC Z(6)9.99.
           02 TLDISP-NET    PIC Z(6)9.99.

       01 EMPLOYEE-PAYROLL.
           02 EMP-TYPE      PIC X(14)   OCCURS 4 TIMES.
           02 EMP-NO        PIC 9(3)    OCCURS 4 TIMES.
           02 EMP-BASIC     PIC 9(7)V99 OCCURS 4 TIMES.
           02 EMP-ALLOWANCE PIC 9(7)V99 OCCURS 4 TIMES.
           02 EMP-GROSS     PIC 9(7)V99 OCCURS 4 TIMES.
           02 EMP-DEDUCT    PIC 9(7)V99 OCCURS 4 TIMES.
           02 EMP-NET-PAY   PIC 9(7)V99 OCCURS 4 TIMES.
       01 TOTALS.
           02 TL-EMP-NO    PIC 9(3).
           02 TL-BASIC     PIC 9(7)V99.
           02 TL-ALLOWANCE PIC 9(7)V99.
           02 TL-GROSS     PIC 9(7)V99.
           02 TL-DEDUCT    PIC 9(7)V99.
           02 TL-NET-PAY   PIC 9(7)V99.
       
       01 EMP-INPUT.
           02 IN-EMPNO PIC 9(3).
           02 IN-BASIC.
               03 BASIC-WHOLE PIC 9(7).
               03 BASIC-DECIM PIC 9(2).

       01 DISPLAY-VARS.
           02 Q-COL    PIC 99 VALUE 5.
           02 A-COL    PIC 99 VALUE 50.
           02 WS-COL   PIC 99.

       01 INX PIC 99 VALUE 1.

       SCREEN SECTION.
           01 BLNKSCR.
               02 BLANK SCREEN.
       
       PROCEDURE DIVISION.
           PERFORM INIT-TYPES.
           PERFORM INPUT-VALUES VARYING INX FROM 1 BY 1 UNTIL INX > 4.
           PERFORM COMPUTE-PAYROLL.
           PERFORM CLOSE-PROGRAM.

       INIT-TYPES.
           MOVE "FACULTY"        TO EMP-TYPE(1).
           MOVE "ADMINISTRATIVE" TO EMP-TYPE(2).
           MOVE "UTILITY"        TO EMP-TYPE(3).
           MOVE "SECURITY"       TO EMP-TYPE(4).

       INPUT-VALUES.
           DISPLAY BLNKSCR.
           DISPLAY "EMPLOYEE PAYROLL CREATION" LINE 2 COLUMN 28.
           DISPLAY "ABCDEF TECHNOLOGY COMPANY" LINE 3 COLUMN 28.
           DISPLAY " " EMP-TYPE(INX) LINE 5 COLUMN 27.
           COMPUTE WS-COL = 27 + LENGTH OF FUNCTION TRIM(EMP-TYPE(INX)).
           DISPLAY " EMPLOYEES PAYROLL" 
               LINE 5 COLUMN WS-COL.
           
           DISPLAY SPACE "ENTER NUMBER OF " LINE 7 COLUMN Q-COL.
           COMPUTE WS-COL = 16 + Q-COL
           DISPLAY EMP-TYPE(INX) LINE 7 COLUMN WS-COL.
           ADD LENGTH OF FUNCTION TRIM(EMP-TYPE(INX)) TO WS-COL.
           DISPLAY " EMPLOYEES: " LINE 7 COLUMN  WS-COL.
           ACCEPT IN-EMPNO LINE 7 COLUMN A-COL.
           MOVE IN-EMPNO TO EMP-NO(INX).

           DISPLAY SPACE "ENTER BASIC PAY OF " LINE 9 COLUMN Q-COL.
           COMPUTE WS-COL = 19 + Q-COL
           DISPLAY EMP-TYPE(INX) LINE 9 COLUMN WS-COL.
           ADD LENGTH OF FUNCTION TRIM(EMP-TYPE(INX)) TO WS-COL.
           DISPLAY " EMPLOYEES: " LINE 9 COLUMN  WS-COL.
           DISPLAY "." LINE 9 COLUMN 57.
           DISPLAY "00" LINE 9 COLUMN 58.
           ACCEPT BASIC-WHOLE LINE 9 COLUMN A-COL.
           COMPUTE WS-COL = A-COL + 8.
           ACCEPT BASIC-DECIM LINE 9 COLUMN WS-COL.
           MOVE IN-BASIC TO EMP-BASIC(INX).

       COMPUTE-PAYROLL.
           PERFORM VARYING INX FROM 1 BY 1 UNTIL INX > 4
               COMPUTE EMP-ALLOWANCE(INX) = EMP-BASIC(INX) * 0.10
               COMPUTE EMP-GROSS(INX) = 
                   EMP-BASIC(INX) + EMP-ALLOWANCE(INX)
               COMPUTE EMP-DEDUCT(INX) = EMP-GROSS(INX) * 0.12
               COMPUTE EMP-NET-PAY(INX) = 
                   EMP-GROSS(INX) - EMP-DEDUCT(INX)

               ADD EMP-NO(INX)        TO TL-EMP-NO
               ADD EMP-BASIC(INX)     TO TL-BASIC
               ADD EMP-ALLOWANCE(INX) TO TL-ALLOWANCE
               ADD EMP-GROSS(INX)     TO TL-GROSS
               ADD EMP-DEDUCT(INX)    TO TL-DEDUCT
               ADD EMP-NET-PAY(INX)   TO TL-NET-PAY
           END-PERFORM.

       CLOSE-PROGRAM.
           STOP RUN.
