       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       AUTHOR. GROUP4.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
           SELECT EMP-PAYROLL ASSIGN TO EMP-PAY.DAT
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT EMP-REPORT ASSIGN TO EMP-REP.DAT
               ORGANIZATION IS LINE SEQUENTIAL.
           
       DATA DIVISION.
       FILE SECTION.
       FD EMP-PAYROLL
              LABEL RECORDS ARE STANDARD
       
       FD EMP-REPORT
              LABEL RECORDS ARE STANDARD
       01  EMP-REP-REC    PIC X(100).

       WORKING-STORAGE SECTION.
       01 EMPLOYEE-PAYROLL.
           02 EMP-TYPE.
              03 TYPE1 PIC A(7) VALUE "FACULTY".
              03 TYPE2 PIC A(14) VALUE "ADMINISTRATIVE".
              03 TYPE3 PIC A(7) VALUE "UTILITY".
              03 TYPE4 PIC A(8) VALUE "SECURITY".
           02 EMP-NO PIC 999 OCCURS 4 TIMES.
           02 BASIC PIC 9999999V99 OCCURS 4 TIMES.
           02 ALLOWANCE PIC 9999999V99 OCCURS 4 TIMES.
           02 GROSS PIC 9999999V99 OCCURS 4 TIMES.
           02 DEDUCT PIC 9999999V99 OCCURS 4 TIMES.
           02 NET-PAY PIC 9999999V99 OCCURS 4 TIMES.
       01 TOTALS.
           02 TOTALN PIC A(5) VALUE "TOTAL".
           02 TL-EMP-NO PIC 999.
           02 TL-BASIC PIC 9999999V99.
           02 TL-ALLOWANCE PIC 9999999V99.
           02 TL-GROSS PIC 9999999V99.
           02 TL-DEDUCT PIC 9999999V99.
           02 TL-NET-PAY PIC 9999999V99.
       